behavior/amazon.md

# Table of Contents

-   [Popular questions with STAR template](#orgb3d8ef0)
    -   [Tell me about a time when you were not able to meet a time commitment. What prevented you from meeting it? What was the outcome and what did you learn from it?](#org93f5d75)
    -   [Describe a long-term project that you managed. How did you keep everything moving along in a timely manner?](#orgec767d3)
    -   [Give me an example of a time when you set a goal and were able to meet or achieve it](#orgaefdbb3)
    -   [Tell me about a time you had to quickly adjust your work priorities to meet changing demands.](#org132ad52)
    -   [Tell me an example when you push back to HQ or challenged a decision](#orgfdf35b8)
    -   [Tell me about the toughest decision you&rsquo;ve had to make in the past six months](#org4c7109d)
    -   [Tell me about a decision that you regret.](#org1665d0e)
    -   [What did you do when you needed to motivate a group of individuals?](#orgc483805)
    -   [Tell me about a time you stepped up into a leadership role](#orge7a3b5b)
    -   [Do you collaborate well?](#org70a4f95)
    -   [Describe a situation when you negotiated with others in your organization to reach agreement.](#org44c0aa1)
    -   [We&rsquo;ve all had to work with people that don&rsquo;t like us. How do you deal with someone that doesn&rsquo;t like you?](#orgcf1b1eb)
    -   [We all make mistakes we wish we could take back. Tell me about a time you wish you’d handled a situation differently with a colleague.](#orgd2f7a2b)
    -   [The last time you had to apologize to someone](#org644f5b4)
    -   [Give me an example of a time you faced a conflict while working on a team. How did you handle that?](#orgbf1b76f)
    -   [Tell me about a time when you received negative feedback from your manager. How did you respond?](#orgb07c3b9)
    -   [Tell me about a time when you missed an obvious solution to a problem](#org6fd8271)
    -   [A time when you faced a problem that had multiple possible solutions](#org4a4fe96)
    -   [Tell me about a time when you came up with a new approach to a problem.](#orge9c137e)
    -   [Describe a time when you anticipated potential problems and developed preventive measures.](#org6b77ec9)
    -   [Describe a situation in which you found a creative way to overcome an obstacle.](#org8de9fbb)
    -   [How have you leveraged data to develop a strategy?](#org9aaa66b)
    -   [Tell me a time when you were 75% through a project, & you had to pivot strategy](#org4504d8c)
    -   [Tell me about a time when you had to choose between technologies for a project](#orgef7386b)
    -   [Tell me about a time you had to deal with ambiguity](#orgab0baa6)
    -   [What’s the most innovative new idea that you have implemented?](#org57e83a8)
    -   [Describe a time when you sacrificed short term goals for long term success](#org2f73402)
    -   [Provide an example of when you personally demonstrate ownership.](#orgefc8caa)
    -   [What&rsquo;s your greatest strength](#org1984723)
    -   [Biggest weakness](#org1b2df63)
    -   [We all deal with difficult customers from time to time. Tell me about a challenging client-facing situation and how you handled it.](#orgd0c476b)
    -   [How do you show customer obsession?](#orgbec4889)
    -   [Tell me about a time you recovered from a difficult situation](#orga91ffc5)
    -   [Tell me about a time you failed and what you learned from it](#orgff6b03a)
    -   [Why Amazon](#org15737af)
-   [General tips](#orgb5c9c70)
-   [Resources](#org12bd0c6)



<a id="orgb3d8ef0"></a>

# Popular questions with STAR template


<a id="org93f5d75"></a>

## Tell me about a time when you were not able to meet a time commitment. What prevented you from meeting it? What was the outcome and what did you learn from it?

Sample answer: <https://youtu.be/CQG4Ui0oAmk>

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="orgec767d3"></a>

## Describe a long-term project that you managed. How did you keep everything moving along in a timely manner?

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="orgaefdbb3"></a>

## Give me an example of a time when you set a goal and were able to meet or achieve it

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="org132ad52"></a>

## Tell me about a time you had to quickly adjust your work priorities to meet changing demands.

Sample answer: <https://youtu.be/ys7fLcH5gpg>

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="orgfdf35b8"></a>

## Tell me an example when you push back to HQ or challenged a decision

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="org4c7109d"></a>

## Tell me about the toughest decision you&rsquo;ve had to make in the past six months

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="org1665d0e"></a>

## Tell me about a decision that you regret.

Sample answer: <https://youtu.be/3NExTeMnobU>

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="orgc483805"></a>

## What did you do when you needed to motivate a group of individuals?

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="orge7a3b5b"></a>

## Tell me about a time you stepped up into a leadership role

Sample answer: <https://youtu.be/Tg6BVRTsuic>

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="org70a4f95"></a>

## Do you collaborate well?

Sample answer: <https://youtu.be/UJXkaide9bU>

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="org44c0aa1"></a>

## Describe a situation when you negotiated with others in your organization to reach agreement.

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="orgcf1b1eb"></a>

## We&rsquo;ve all had to work with people that don&rsquo;t like us. How do you deal with someone that doesn&rsquo;t like you?

Sample answer: <https://youtu.be/ZsxkoZdyEcw>

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="orgd2f7a2b"></a>

## We all make mistakes we wish we could take back. Tell me about a time you wish you’d handled a situation differently with a colleague.

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="org644f5b4"></a>

## The last time you had to apologize to someone

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="orgbf1b76f"></a>

## Give me an example of a time you faced a conflict while working on a team. How did you handle that?

Sample answer: <https://youtu.be/Zz8iQ852YMs>

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="orgb07c3b9"></a>

## Tell me about a time when you received negative feedback from your manager. How did you respond?

Sample answer: <https://youtu.be/Zz8iQ852YMs>

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="org6fd8271"></a>

## Tell me about a time when you missed an obvious solution to a problem

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="org4a4fe96"></a>

## A time when you faced a problem that had multiple possible solutions

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="orge9c137e"></a>

## Tell me about a time when you came up with a new approach to a problem.

Sample answer: <https://youtu.be/2XxCUain1IU>

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="org6b77ec9"></a>

## Describe a time when you anticipated potential problems and developed preventive measures.

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="org8de9fbb"></a>

## Describe a situation in which you found a creative way to overcome an obstacle.

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="org9aaa66b"></a>

## How have you leveraged data to develop a strategy?

Sample answer: <https://youtu.be/oRGKHTiM29E>

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="org4504d8c"></a>

## Tell me a time when you were 75% through a project, & you had to pivot strategy

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="orgef7386b"></a>

## Tell me about a time when you had to choose between technologies for a project

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="orgab0baa6"></a>

## Tell me about a time you had to deal with ambiguity

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="org57e83a8"></a>

## What’s the most innovative new idea that you have implemented?

Sample answer: <https://youtu.be/774ovkE2y5I>

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="org2f73402"></a>

## Describe a time when you sacrificed short term goals for long term success

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="orgefc8caa"></a>

## Provide an example of when you personally demonstrate ownership.

Sample answer: <https://youtu.be/Rn3EjvukTkI>

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="org1984723"></a>

## What&rsquo;s your greatest strength

Sample answer: <https://youtu.be/q8fK73QjmbA>

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="org1b2df63"></a>

## Biggest weakness

Sample answer: <https://youtu.be/q8fK73QjmbA>

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="orgd0c476b"></a>

## We all deal with difficult customers from time to time. Tell me about a challenging client-facing situation and how you handled it.

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="orgbec4889"></a>

## How do you show customer obsession?

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="orga91ffc5"></a>

## Tell me about a time you recovered from a difficult situation

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="orgff6b03a"></a>

## Tell me about a time you failed and what you learned from it

Sample answer: <https://youtu.be/eaUUeFoB9CQ>

-   Situation:
-   Task:
-   Action:
-   Result:


<a id="org15737af"></a>

## Why Amazon

Sample answer: <https://youtu.be/H_KGM0i9jkA>


<a id="orgb5c9c70"></a>

# General tips

-   Shouldn&rsquo;t use “we” instead of “I”
-   Practice and rehearse often
-   Be specific in terms of quantifying results: for example, after completion the project, the latency reduce 50% and the service is able to handle 2x traffic
-   Be positive: especially in question of failure, what is most important is what you learn from past mistakes.
-   Study 14 leadership principles. For engineer role, you can skip 2 principles: hire and develop the best, frugality.


<a id="org12bd0c6"></a>

# Resources

-   Algo Expert: <https://www.algoexpert.io/behavioral-interviews>
-   Dan Croitor&rsquo;s Youtube channel: <https://www.youtube.com/channel/UCw0uQHve23oMWgQcTTpgQsQ>

